In [1]:
import requests

In [2]:
import numpy as np
import pandas as pd

In [3]:
dati = [f'2023-02-{i}' for i in np.arange(1,10,1)]

In [4]:
dati

['2023-02-1',
 '2023-02-2',
 '2023-02-3',
 '2023-02-4',
 '2023-02-5',
 '2023-02-6',
 '2023-02-7',
 '2023-02-8',
 '2023-02-9']

In [5]:
datf = [f'2023-04-01' for i in np.arange(1,10,1)]

In [6]:
datf

['2023-04-01',
 '2023-04-01',
 '2023-04-01',
 '2023-04-01',
 '2023-04-01',
 '2023-04-01',
 '2023-04-01',
 '2023-04-01',
 '2023-04-01']

In [7]:
df = pd.DataFrame({'Data1': dati, 'Data2': datf})

In [8]:
df

       Data1       Data2
0  2023-02-1  2023-04-01
1  2023-02-2  2023-04-01
2  2023-02-3  2023-04-01
3  2023-02-4  2023-04-01
4  2023-02-5  2023-04-01
5  2023-02-6  2023-04-01
6  2023-02-7  2023-04-01
7  2023-02-8  2023-04-01
8  2023-02-9  2023-04-01

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data1   9 non-null      object
 1   Data2   9 non-null      object
dtypes: object(2)
memory usage: 276.0+ bytes

In [12]:
df['Data1'] = pd.to_datetime(df['Data1'])

In [13]:
df['Data2'] = pd.to_datetime(df['Data2'])

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data1   9 non-null      datetime64[ns]
 1   Data2   9 non-null      datetime64[ns]
dtypes: datetime64[ns](2)
memory usage: 276.0 bytes

In [18]:
df['Anomes1'] = df['Data1'].dt.strftime('%Y%m')

In [19]:
df

       Data1      Data2 Anoomes1 Anomes1
0 2023-02-01 2023-04-01   202302  202302
1 2023-02-02 2023-04-01   202302  202302
2 2023-02-03 2023-04-01   202302  202302
3 2023-02-04 2023-04-01   202302  202302
4 2023-02-05 2023-04-01   202302  202302
5 2023-02-06 2023-04-01   202302  202302
6 2023-02-07 2023-04-01   202302  202302
7 2023-02-08 2023-04-01   202302  202302
8 2023-02-09 2023-04-01   202302  202302

In [20]:
df['Data1'].dt.month

0    2
1    2
2    2
3    2
4    2
5    2
6    2
7    2
8    2
Name: Data1, dtype: int32

In [21]:
df = pd.read_csv('realtor-data.csv')

In [22]:
df.head()

,status,bed,bath,acre_lot,city,state,zip_code,house_size,prev_sold_date,price
0,for_sale,3.0,2.0,0.12,Adjuntas,Puerto Rico,601.0,920.0,NaN,105000.0
1,for_sale,4.0,2.0,0.08,Adjuntas,Puerto Rico,601.0,1527.0,NaN,80000.0
2,for_sale,2.0,1.0,0.15,Juana Diaz,Puerto Rico,795.0,748.0,NaN,67000.0
3,for_sale,4.0,2.0,0.10,Ponce,Puerto Rico,731.0,1800.0,NaN,145000.0
4,for_sale,6.0,2.0,0.05,Mayaguez,Puerto Rico,680.0,NaN,NaN,65000.0

In [30]:
df = df[df['status']== 'for_sale']

In [31]:
df['status'].unique()

array(['for_sale'], dtype=object)

In [33]:
df = df.sort_values(['status','city','state','price','house_size'])

In [35]:
df.duplicated(['status','city','state','price'])

73297    False
73643     True
77541     True
78205     True
78448     True
         ...
17699     True
11713    False
17074     True
17326     True
17783     True
Length: 99819, dtype: bool

In [37]:
df.sort_values(['house_size'])

,status,bed,bath,acre_lot,city,state,zip_code,house_size,prev_sold_date,price
60651,for_sale,1.0,1.0,NaN,South Windsor,Connecticut,6074.0,100.0,NaN,20000.0
50773,for_sale,1.0,1.0,NaN,South Windsor,Connecticut,6074.0,100.0,NaN,20000.0
18043,for_sale,3.0,1.0,0.02,San Juan,Puerto Rico,923.0,181.0,NaN,93000.0
83834,for_sale,1.0,1.0,8.50,Lyme,Connecticut,6371.0,200.0,NaN,165000.0
10337,for_sale,NaN,1.0,NaN,Saint Thomas,Virgin Islands,802.0,235.0,NaN,115000.0
...,...,...,...,...,...,...,...,...,...,...
17699,for_sale,NaN,NaN,1.83,NaN,Virgin Islands,NaN,NaN,NaN,649000.0
11713,for_sale,NaN,NaN,3.91,NaN,Virgin Islands,NaN,NaN,NaN,935000.0
17074,for_sale,NaN,NaN,3.91,NaN,Virgin Islands,NaN,NaN,NaN,935000.0
17326,for_sale,NaN,NaN,3.91,NaN,Virgin Islands,NaN,NaN,NaN,935000.0
17783,for_sale,NaN,NaN,3.91,NaN,Virgin Islands,NaN,NaN,NaN,935000.0

In [41]:
df = df.drop_duplicates(['status','city','state','price'])

In [42]:
df.shape

(12067, 10)

In [52]:
df1 = df[df['state'] == 'Massachusetts'].sample(n=250)
df2 = df[df['state'] == 'Puerto Rico'].sample(n=250)
df3 = df[df['state'] == 'Connecticut'].sample(n=250)
juntos = ['Rhode Island', 'New York']
df4 = df[df['state']].isin(juntos).sample(n=250)

KeyError: "None of [Index(['Massachusetts', 'Massachusetts', 'Massachusetts', 'Massachusetts',\n       'Massachusetts', 'Massachusetts', 'Massachusetts', 'Massachusetts',\n       'Massachusetts', 'Massachusetts',\n       ...\n       'Virgin Islands', 'Virgin Islands', 'Virgin Islands', 'Virgin Islands',\n       'Virgin Islands', 'Virgin Islands', 'Virgin Islands', 'Virgin Islands',\n       'Virgin Islands', 'Virgin Islands'],\n      dtype='object', length=12067)] are in the [columns]"

In [47]:
pd.concat([df1,df2,df3,df4], ignore_index=True)

,status,bed,bath,acre_lot,city,state,zip_code,house_size,prev_sold_date,price
0,for_sale,3.0,2.0,0.11,Worcester,Massachusetts,1603.0,1658.0,2001-06-29,375000.0
1,for_sale,3.0,3.0,0.19,Great Barrington,Massachusetts,1230.0,1876.0,2012-11-01,649000.0
2,for_sale,3.0,4.0,0.15,Lexington,Massachusetts,2420.0,2500.0,NaN,1250000.0
3,for_sale,5.0,5.0,43.20,Williamstown,Massachusetts,1267.0,3392.0,NaN,1300000.0
4,for_sale,3.0,3.0,0.24,Fitchburg,Massachusetts,1420.0,1800.0,1989-03-07,424000.0
...,...,...,...,...,...,...,...,...,...,...
995,for_sale,3.0,2.0,0.19,Johnston,Rhode Island,2919.0,1356.0,2016-02-09,325000.0
996,for_sale,2.0,3.0,NaN,Cumberland,Rhode Island,2864.0,1496.0,NaN,315000.0
997,for_sale,NaN,NaN,75.50,Richmond,Rhode Island,2892.0,NaN,NaN,2100000.0
998,for_sale,8.0,3.0,0.13,Woonsocket,Rhode Island,2895.0,6800.0,2016-06-10,419900.0
999,for_sale,6.0,3.0,0.11,Woonsocket,Rhode Island,2895.0,4650.0,NaN,350000.0

In [48]:
list_state = ['Massachusetts', 'Puerto Rico', 'Connecticut']
state_junt = ['Rhode Island', 'New York']
df['new_div'] = df.apply(lambda x: x['state'] if x['state'] in list_state
                         else 'juntos' if x['state' in state_junt else 'outros', axis = 1])

SyntaxError: expected 'else' after 'if' expression (4114126709.py, line 4)